# ParameterTypeId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId Class
Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ParameterTypeId
```

Visual Basic
---
```text
Public NotInheritable Class ParameterTypeId
```

Visual C++
---
```text
public ref class ParameterTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterTypeId
# See Also
ParameterTypeId Members
Autodesk.Revit.DB Namespace